src/cf/InformationRegisters/fmDepartmentHierarchy.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>fmDepartmentHierarchy</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Level</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>DeletionMark</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Department</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.fmDepartments</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>DepartmentParent</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.fmDepartments</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>StructureVersion</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.fmDepartmentsStructuresVersions</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/fmDepartmentHierarchy/Ext/ManagerModule.bsl
#If Server OR ThickClientOrdinaryApplication OR ExternalConnection Then
	
&AtServer
Procedure RefreshLevelsAtServer() Export
	Query = New Query;
	Query.Text = "SELECT
	               |	DepartmentsStructuresVersions.Ref
	               |FROM
	               |	Catalog.fmDepartmentsStructuresVersions AS DepartmentsStructuresVersions
	               |WHERE
	               |	NOT DepartmentsStructuresVersions.DeletionMark";
	Selection = Query.Execute().SELECT();
	
	While Selection.Next() Do
			oVersion = Selection.Ref;
			StrParameters = New Structure;
			StrParameters.Insert("StructureVersionForBuilding", oVersion);
			StrParameters.Insert("HeaderPeriodEnd", oVersion.DateValidUntil);
			StrParameters.Insert("LimitByAccessGroups", False);
			StrParameters.Insert("OutputTree", True);
			DepartmentTree = fmBudgeting.DepartmentCommonTree(StrParameters);
			FillDepartmentsTreeLevelsInRegister(oVersion,, DepartmentTree.Rows, 1);
	EndDo;
EndProcedure

&AtServer
Procedure FillDepartmentsTreeLevelsInRegister(oVersion, oHierarchyType, TreeRows, RowsLevel)
	For Each LevelRow In TreeRows Do
		//проставим в записях рс уровни и перейдм ниже
		RecordInIR = InformationRegisters.fmDepartmentHierarchy.CreateRecordManager();
		RecordInIR.StructureVersion = oVersion;
		RecordInIR.Department = LevelRow.Department;
		If TypeOf(LevelRow.Parent) = Type("CatalogRef.fmDepartments") Then
			RecordInIR.DepartmentParent = LevelRow.Parent;
		Else
			If NOT LevelRow.Parent = Undefined Then
				RecordInIR.DepartmentParent = LevelRow.Parent.Department;
			EndIf;
		EndIf;
		RecordInIR.Read();
		If RecordInIR.Selected() Then
			RecordInIR.Level = RowsLevel;
			RecordInIR.Write();
		EndIf;
		FillDepartmentsTreeLevelsInRegister(oVersion, oHierarchyType, LevelRow.Rows, RowsLevel + 1);
	EndDo;
EndProcedure

#EndIf
